# SqlAlchemy
    - É uma biblioteca de ORM;
    - Conexão fácil;
    - Mapemento de tabela com classe;
    - Resolve conflitos de tecnologias com paradigmas diferentes;
    - Tudo fique orientado a objetos.

In [56]:
import pandas as pd

In [57]:
from sqlalchemy import create_engine

In [58]:
import pymysql

In [59]:
import urllib.parse

# dados para a conectar
user = 'root'
password = urllib.parse.quote_plus('senai@123')
host = 'localhost'
#host = 127.0.0.1
port = 3306
database = 'projetodiario1'

# Sting para conectar
conection_string = f'mysql+pymysql://{user}:{password}@{host}:{port}/{database}'

# Criando a conexão
engine = create_engine(conection_string)

# Query 
 
query_alunos = "SELECT * FROM aluno" 
query_diario = "SELECT * FROM diariobordo" 

# Cria um dataframe com a consulta sql
df_alunos = pd.read_sql(query_alunos,engine)
df_diario = pd.read_sql(query_diario,engine)

df_alunos

    id        ra            Nome  tempoestudo  rendafamiliar
0    1  00034549            None            0            NaN
1    2  00034547            None            0            NaN
2    3  00034549            None            0            NaN
3    4  00034550            None            0            NaN
4    5  00034551            None            0            NaN
..  ..       ...             ...          ...            ...
83  84  12345744    Xuxa Almeida           12         2700.0
84  85  12345745  Yuri Rodrigues           14         2900.0
85  86  12345746    Zilda Santos           16         3100.0
86  87  12345747      Alan Costa           11         2600.0
87  88  12345748    Bárbara Lima           13         2800.0

[88 rows x 5 columns]

# Bibliotecas do panda
    -Pandas (EDA - Análise Explotória de dados)
    -Sckit-Learn(Fundamentos de inteligência artificial)
    -Numpy (Matemática Complexa com abstração)

# Salvando o DataFrame
    - .csv
    - .xms
    - .jason
    - .sql
    - .html
    - .xml

In [60]:
csv_filename = 'alunos.csv'
df_alunos.to_csv(csv_filename,index=False)

In [61]:
# Crie uma nova celula que salve o dataframe no formato JSON
json_filename = 'alunos.json'
df_alunos.to_json(json_filename,index=False)

In [62]:
#Exercio: como mostar os registro do DataFrama usando fatiamento

df_alunos[35:40]

    id        ra            Nome  tempoestudo  rendafamiliar
35  36  12345696  Bruno Oliveira           12         2700.0
36  37  12345697     Carla Souza           14         2900.0
37  38  12345698    Daniel Costa           16         3100.0
38  39  12345699  Elaine Martins            8         2300.0
39  40  12345700   Fernando Lima           11         2600.0

In [63]:
df_alunos.head(2)

   id        ra  Nome  tempoestudo  rendafamiliar
0   1  00034549  None            0            NaN
1   2  00034547  None            0            NaN

In [64]:
df_alunos.tail(3)

    id        ra          Nome  tempoestudo  rendafamiliar
85  86  12345746  Zilda Santos           16         3100.0
86  87  12345747    Alan Costa           11         2600.0
87  88  12345748  Bárbara Lima           13         2800.0

In [65]:
df_alunos.iloc[-3:]

    id        ra          Nome  tempoestudo  rendafamiliar
85  86  12345746  Zilda Santos           16         3100.0
86  87  12345747    Alan Costa           11         2600.0
87  88  12345748  Bárbara Lima           13         2800.0

In [66]:
df_alunos.shape

(88, 5)

In [67]:
df_alunos.columns

Index(['id', 'ra', 'Nome', 'tempoestudo', 'rendafamiliar'], dtype='object')

In [68]:
df_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 88 entries, 0 to 87
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             88 non-null     int64
 1   ra             88 non-null     object
 2   Nome           54 non-null     object
 3   tempoestudo    88 non-null     int64
 4   rendafamiliar  54 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 3.6+ KB

In [69]:
df_alunos.describe()

              id  tempoestudo  rendafamiliar
count  88.000000    88.000000      54.000000
mean   44.500000     7.659091    2735.185185
std    25.547342     6.369623     266.463497
min     1.000000     0.000000    2100.000000
25%    22.750000     0.000000    2525.000000
50%    44.500000    10.000000    2750.000000
75%    66.250000    13.000000    2900.000000
max    88.000000    16.000000    3200.000000

Crie um novo DataFrame da tabela diariobordo do mysql

In [70]:
df_diario.describe()

             id             datahora  fk_aluno_id
count  9.000000                    9     9.000000
mean   5.000000  2024-08-03 19:44:20    14.444444
min    1.000000  2024-08-01 09:16:00     2.000000
25%    3.000000  2024-08-01 10:45:00    14.000000
50%    5.000000  2024-08-03 11:00:00    15.000000
75%    7.000000  2024-08-05 09:00:00    16.000000
max    9.000000  2024-08-07 12:00:00    24.000000
std    2.738613                  NaN     5.681354

In [73]:
pd.merge(df_diario,df_alunos, how ='left', left_on='fk_aluno_id', right_on='id')

,id_x,texto,datahora,fk_aluno_id,id_y,ra,Nome,tempoestudo,rendafamiliar
0,1,a aula foi legal,2024-08-01 09:16:00,2,2,00034547,None,0,NaN
1,2,estou aprendendo insert,2024-08-01 09:33:00,24,24,00034570,None,0,NaN
2,3,O professor explicou bem o conceito de álgebra...,2024-08-01 10:45:00,14,14,00034560,None,0,NaN
3,4,Fizemos uma atividade em grupo sobre sustentab...,2024-08-02 14:30:00,15,15,00034561,None,0,NaN
4,5,A revisão para a prova de história foi muito p...,2024-08-03 11:00:00,13,13,00034559,None,0,NaN
5,6,Tivemos uma aula prática de laboratório de quí...,2024-08-04 13:15:00,16,16,00034562,None,0,NaN
6,7,Discutimos a importância da literatura no dese...,2024-08-05 09:00:00,14,14,00034560,None,0,NaN
7,8,"A aula de educação física foi cansativa, mas d...",2024-08-06 16:20:00,17,17,00034563,None,0,NaN
8,9,Aprendemos sobre técnicas de programação em Py...,2024-08-07 12:00:00,15,15,00034561,None,0,NaN